constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  3.0                                   |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    airfoil
    {
        type            wall;
        nFaces          400;
        startFace       943334;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       943734;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       943784;
    }
    frontAndBackPlanes
    {
        type            empty;
        nFaces          1258112;
        startFace       943834;
    }
)

// ************************************************************************* //
