system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         120;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 1;


maxDeltaT 0.03;

libs ("libforces.so");

functions
{
    

	RBFMotion
    {
        type RBFMotion;
        functionObjectLibs ("libmyRBFMotionFunction.so");
        rotationAmplitude        0.2617;
        rotationFrequency        0.3333;
        translationAmplitude    (0.0 0.5 0.0);
        translationFrequency    (0.0 0.3333 0.0);
        initialRotationOrigin    (0.25 0 0);

	}

forces
    {
        type                forces;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      10;
        patches             (airfoil);
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0.25 0 0);
    }

	

}



// ************************************************************************* //
