system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default         Gauss linear;
     grad(p)         Gauss linear;
	grad(p_p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss GammaV 0.5;
	div(phi_p,U)     Gauss GammaV 0.5;
	div(phi,u_p)      Gauss GammaV 0.5;
}

laplacianSchemes
{
    default         none;
    laplacian(nu,U) Gauss linear limited 0.5;
    laplacian(nu,u_p) Gauss linear limited 0.5;
    laplacian(rUA,pcorr) Gauss linear limited 0.5;
    laplacian(rAU,p) Gauss linear limited 0.5;
	 laplacian(ru_pA,p_pcorr) Gauss linear limited 0.5;
    laplacian(rAu_p,p_p) Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         limited 0.5;
}

fluxRequired
{
    default         no;
    pcorr;
    p;
	p_pcorr;
    p_p;
}

// ************************************************************************* //
